do 

local function th3boss(msg, matches) 
if matches[1]=="الاوامر" and is_sudo(msg) then 
return  " هلآ وسهلآ بك 😻✋️\nهناك  ثلاثه اوامر في البوت \n➖➖➖➖➖➖➖➖➖\n[♦️] م1\n[♦️] م2\n[♦️] م3\n➖➖➖➖➖➖➖➖➖\nاي استفسار راسل المطور 〽️\n#DEV ♻️ @HUSSEINAli33\n قناه السورس ♻️ @SENATOR1994"
elseif matches[1]=="م1" then 
return  "هلآ وسهلآ بك 😻✋️ \nاوامر البوت ➖➖➖➖➖➖➖➖➖\n[♦️] تفعيل :  \n[♦️] تعطيل : \n[♦️]رفع مطور: \n[♦️] تنزيل مطور : \n[♦️] المطوريين : \n[♦️] رفع المدير : \n[♦️] تنزيل المدير :  \n[♦️] رفع اداري : \n[♦️]  تنزيل اداري : \n[♦️] رفع ادمن : \n[♦️] تنزيل ادمن  :\n[♦️] مسح معرف البوت : \n[♦️] ضع معرف البوت :\n[♦️] ضع اسم البوت :\n[♦️] ادخل :\n[♦️] صنع خارقه :\n[♦️]  ترقيه سوبر : \n[♦️] انشاء مجموعه :\n[♦️]  المطور : \n[♦️] طرد البوت : \n[♦️] الملفات :  \n[♦️] تفعيل ملف +اسم الملف : \n[♦️] تعطيل الملف +اسم الملف : \n[♦️] الملفات المفعله : \n[♦️] معلوماتي  :\n[♦️] اذاعه \n[♦️] الماركدوان تفعيل \n[♦️] الماركدوان تعطيل\n➖➖➖➖➖➖➖➖➖\nاي استفسار راسل المطور  〽️\n#DEV ♻️@HUSSEINAli33\nقناه السورس ♻️ @SENATOR1994"
elseif matches[1]=="م2" then 
return "اهلآ وسهلآ بك 😻✋️\n اوامر اليوت  \n➖➖➖➖➖➖➖➖➖\n[♦️] قفل🔓 او فتح 🔐 الروابط\n[♦️] قفل🔓 او فتح 🔐 التاك\n[♦️] قفل🔓 او فتح 🔐 التعديل\n[♦️] قفل🔓 او فتح 🔐 العربيه\n[♦️] قفل🔓 او فتح 🔐 الاعلانات\n[♦️] قفل🔓 او فتح 🔐 البوتات\n[♦️] قفل🔓 او فتح 🔐 التكرار\n[♦️] قفل🔓 او فتح 🔐 الكلايش\n[♦️] قفل🔓 او فتح 🔐 الماركدوان\n[♦️] قفل🔓 او فتح 🔐 المتحركه\n[♦️] قفل🔓 او فتح 🔐 الصور\n[♦️] قفل🔓 او فتح 🔐  الملفات\n[♦️] قفل🔓 او فتح 🔐 الملصقات\n[♦️] قفل🔓 او فتح 🔐 الفيديو\n[♦️] قفل🔓 او فتح 🔐 الصوت\n[♦️] قفل🔓 او فتح 🔐 البصمات\n[♦️] قفل🔓 او فتح 🔐 الجهات\n[♦️] قفل🔓 او فتح 🔐 النص\n[♦️] قفل🔓 او فتح 🔐 التوجيه\n[♦️] قفل🔓 او فتح 🔐 الموقع\n[♦️] قفل🔓 او فتح 🔐 النلاين\n[♦️] قفل🔓 او فتح 🔐 الالعاب\n[♦️] قفل🔓 او فتح 🔐 المحادثه\n[♦️] قفل🔓 او فتح 🔐 الاشعارات\n➖➖➖➖➖➖➖➖➖\nاي استفسار راسل المطور〽️\n#DEV ♻️@HUSSEINAli33\nقناه السورس ♻️@"
elseif matches[1]=="م3" then 
return  "  هلآ وسهلآ بك😻✋️\nاوامر البوت \n➖➖➖➖➖➖➖➖➖\n[♦️] حظر عام : \n[♦️] الغاء العام : \n[♦️] حظر :  \n[♦️]الغاء الحظر : \n[♦️] دي : \n[♦️] كتم : \n[♦️] الغاء الكتم : \n[♦️]  رفع ادمن :  \n[♦️] تنزيل ادمن : \n[♦️] الاعدادات : \n[♦️] ضع رابط : \n[♦️] الرابط : \n[♦️]  ضع قوانين : \n[♦️]  القوانين : \n[♦️] ضع وصف : \n[♦️]  الوصف : \n[♦️]  ضع اسم : لتغير اسم المجموعه\n[♦️] ضع تكرار : لوضع تكرار عدد  [1]الى [50] \n[♦️] ضع ترحيب : \n[♦️]  ايدي : \n[♦️]  تثبيت : \n[♦️]  الغاء التثبيت :\n[♦️] معلومات المجموعه :\n[♦️] المدراء : \n[♦️] الادمنيه : \n[♦️]  منع :\n[♦️]  الغاء المنع :\n[♦️]  قائمه المنع : \n[♦️] قائمه العام : \n[♦️] قائمه الحظر : \n[♦️] قائمه الكتم : \n[♦️] مسح القوانين :\n[♦️] مسح الوصف : \n[♦️] مسح الترحيب:\n[♦️] مسح الادمنيه :\n[♦️] مسح قائمه المنع :\n[♦️] مسح قائمه العام :\n[♦️] مسح قائمه المنع :\n[♦️] مسح قائمه الكتم :\n[♦️] مسح الكل : لمسح رسائل العضو\n➖➖➖➖➖➖➖➖➖\nاي استفسار راسل المطور  〽️\n#DEV ♻️@HUSSEINAli33\nقناه السورس ♻️ @SENATOR1994" 
else 
end 

end 

return { 
  patterns = { 
  "^(الاوامر)$", 
  "^(م1)$", 
  "^(م2)$", 
  "^(م3)$", 

    }, 
  run = th3boss 
} 
end 